app/controllers/inform_controller.rb

  def view
    @records = Progress.all
---
SELECT "progresses".* FROM "progresses"

  def create
    res = Progress.find_by(parse_params)
    if res.nil?
      record = Progress.new(parse_params)
      if record.save
---
INSERT INTO "progresses" ("name", "surname", "classroom", "activity", "result", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)