app/controllers/users/registrations_controller.rb

INSERT INTO "users" ("name", "surname", "email", "encrypted_password", "key_role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(parse_params)
    if @user.save